cask_args appdir: "/Applications"

## brew cask and more versions of casks
tap "caskroom/versions"
tap "caskroom/cask"

## Add tap for unity-version-manager
tap "wooga/tools"

## Add tap for Pivotal
tap "pivotal/tap"

## My tap for android-ndk-r10e
tap "nobitagamer/cask"

brew "mas"
brew "curl", args: ["with-openssl"]
brew "git-extras"
brew "git-flow-avh"
brew "gitlab-ci-multi-runner", restart_service: true
brew "gitversion"
brew "imagemagick"
brew "librsvg"
brew "rbenv"
brew "wooga/tools/unity-version-manager"

## Shell stuff
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "tmux"
brew "tmate"

cask "dotnet"
cask "java8"
cask "android-sdk"
cask "nobitagamer/cask/android-ndk"
cask "gitkraken"
cask "iterm2"
cask "kdiff3"
cask "launchcontrol"
cask "visual-studio"
cask "visual-studio-code"

# cask "unity-android-support-for-editor"
# cask "unity-ios-support-for-editor"
## Productive stuff
# ack
# curl
# httpie
# wget
# mas
# packer
# watch

## Programming stuff
# rbenv
# ruby-build
# ngrok
# nvm
# npm
# python
# git
# git-flow

mas "slack", id: 803453959
mas "onedrive", id: 823766827
mas "xcode", id: 497799835

## VPN stuff
#tuntap
#openconnect

## brew cask and more versions of casks
# caskroom/cask/brew-cask

## Pivotal CF cli
# cloudfoundry-cli
